# -*- coding: UTF-8 -*-
__author__ = 'zy'
__time__ = '2019/9/6 13:59'
import pandas
import requests,time
import pandas as pd
import numpy as np
r=open(r'写入OD.csv','r+',encoding='utf-8')
tmp=pd.read_csv(r)
r.close()

print(tmp.sort_values(by='weight'))

#以0开始

# 1388  40  37   101.0    NaN   30.666449,104.065608  30.653575,104.079433  骡马市 春熙路
# 293    8  13   102.0    NaN   30.70445549,104.0826895  30.72249994,104.0601645  成都站  欢乐谷
# 1325  39  12   102.0    NaN    30.6609025,104.05682  30.64448922,104.0493803 人民公园  武侯祠
# 116    2  37   115.0    NaN   30.67035758,104.0756173  30.653575,104.079433 草市街（汽修住宅） 春熙路
# 456   13   8   117.0    NaN   30.72249994,104.0601645   30.70445549,104.0826895  欢乐谷（住宅区） 成都站 升仙湖
# 445   12  37   124.0    NaN    30.64448922,104.0493803  30.653575,104.079433  武侯祠 春熙路

# 1231  36  37    67.0    NaN           天府广场 春熙路
# 1275  37  40    75.0    NaN        春熙路  骡马市
# 1237  37   2    80.0    NaN       春熙路   草市街
# 629   17  37    83.0    NaN      30.6454507,104.061068   30.653575,104.079433  黉门街居民区  春熙路
# 1349  39  37    97.0    NaN  30.6609025,104.05682  30.653575,104.079433  人民公园  春熙路


# 12  38   124.0
# 13   9   117.0
# 2  38   115.0    NaN
# 8  14   102.0    NaN
# 39  13   102.0    NaN
# 39  38    97.0    NaN